In [2]:
import pandas as pd
import numpy as np

In [3]:
popularity = pd.read_csv('Meal Plan Data - Dining Hall Popularity.csv')
donations = pd.read_csv('Meal Plan Data - Donations.csv')
location = pd.read_csv('Meal Plan Data - Hill vs Campus.csv')
enrollment = pd.read_csv('Meal Plan Data - Enrollment.csv')
leftover = pd.read_csv('Meal Plan Data - Leftover.csv')

In [4]:
popularity

                 Location Weekly Swipes
0       Epicuria at Covel         8,998
1                 De Neve        22,227
2  Spice Kitchen at Feast         7,413
3             Bruin Plate        24,999
4              Bruin Café         9,983
5               Café 1919         4,057
6              Rendezvous        21,299
7    The Study at Hedrick        29,589
8                The Drey         5,023

In [6]:
donations

       Quarter  Swipes
0    Fall 2022  32,684
1  Winter 2023  18,235
2  Spring 2023  16,754

In [7]:
location

  Quarter  The Hill  On Campus
0     F23       0.8        0.2

In [8]:
enrollment

   Unnamed: 0   11P  11R   14P  14R   19P   19R
0        2223  1491  444  5241  951  3461  1670
1        2324  1530  371  5814  938  4199  1584

In [9]:
leftover

  Unnamed: 0     11P    11R     14P    14R     19P     19R
0        F22  23,486  1,852  76,959  6,712  85,095  16,070
1        W23  19,256  1,870  49,481  6,351  57,916  15,111
2        S23  18,531  1,708  50,659  5,678  56,292  14,436